core_backend/loadtest.yml
# loadtest.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 1
  processor: "./src/artillery-function.js"
  verbose: true
  ensure:
    maxErrorRate: 1
  http:
    pool: 10
    timeout: 10

scenarios:
  - name: "Transaction Test with Customer Pool"
    beforeScenario: "beforeScenario"
    flow:
      - function: "selectRandomCustomer"
      - post:
          url: "/transactions"
          headers:
            accept: "*/*"
            Content-Type: "application/json"
          json:
            transactionType: "CustomerPayBillOnline"
            transAmount: "{{ vars.transAmount }}"
            businessShortCode: "12345"
            billRefNumber: ""
            thirdPartyTransID: "test{{ $randomString(10) }}"
            MSISDN: "{{ vars.selectedCustomer.msisdn }}"
            firstName: "{{ vars.selectedCustomer.firstName }}"
          capture:
            - json: "$"
              as: "response"
      - log: "Transaction completed for customer {{ vars.selectedCustomer.msisdn }} with amount {{ vars.transAmount }}"
      - log: "Response received: {{ response }}"
    weight: 1