core_backend/loadtest.yml
# loadtest.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 1
  processor: "./src/artillery-function.js"
  verbose: true
  ensure:
    maxErrorRate: 1
  http:
    pool: 10
    timeout: 10

scenarios:
  - name: "Simple Transaction Test"
    flow:
      - post:
          url: "/transactions"
          headers:
            accept: "*/*"
            Content-Type: "application/json"
          json:
            transactionType: "CustomerPayBillOnline"
            transAmount: 200
            businessShortCode: "12345"
            billRefNumber: ""
            thirdPartyTransID: "test123"
            MSISDN: "254700000127"
            firstName: "John"
          capture:
            - json: "$"
              as: "response"
      - log: "Response received: {{ response }}"